[Killed] MethodCallRemoval
Bank.php:31:9
     public static function create(Currency $currency1, Currency $currency2, float $rate)
     {
         $bank = new Bank($currency1, []);
-        $bank->addEchangeRate($currency1, $currency2, $rate);
+        
 
         return $bank;
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:61
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:21
/home/runner/work/xtrem-c

[Killed] ConcatOperandRemoval
Bank.php:45:9
      */
     public function addEchangeRate(Currency $currency1, Currency $currency2, float $rate): void
     {
-        $this->exchangeRates[($currency1 . '->' . $currency2)] = $rate;
+        $this->exchangeRates[$currency1 . $currency2] = $rate;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:61
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:21
/home/runner/work/xtrem-c

[Killed] ConcatOperandRemoval
Bank.php:50:9
 
     private function getExchangeRate(Currency $currency1, Currency $currency2): ?float
     {
-        if (!isset($this->exchangeRates[($currency1 . '->' . $currency2)])) {
+        if (!isset($this->exchangeRates[$currency1 . $currency2])) {
             return null;
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
TypeError: MoneyProblem\Domain\Money::convert(): Argument #1 ($rate) must be of type float, null given, called in /home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php on line 63

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src

[Killed] Concat
Bank.php:50:9
 
     private function getExchangeRate(Currency $currency1, Currency $currency2): ?float
     {
-        if (!isset($this->exchangeRates[($currency1 . '->' . $currency2)])) {
+        if (!isset($this->exchangeRates['->' . $currency1 . $currency2])) {
             return null;
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
TypeError: MoneyProblem\Domain\Money::convert(): Argument #1 ($rate) must be of type float, null given, called in /home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php on line 63

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src

[Killed] Concat
Bank.php:53:9
         if (!isset($this->exchangeRates[($currency1 . '->' . $currency2)])) {
             return null;
         }
-        return $this->exchangeRates[($currency1 . '->' . $currency2)];
+        return $this->exchangeRates[$currency1 . $currency2 . '->'];
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
Undefined array key "EUREUR->"

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:47
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:63
/home/runner/work/xtrem-craft-workshop/xtrem-craft-worksho

[Killed] ConcatOperandRemoval
Bank.php:53:9
         if (!isset($this->exchangeRates[($currency1 . '->' . $currency2)])) {
             return null;
         }
-        return $this->exchangeRates[($currency1 . '->' . $currency2)];
+        return $this->exchangeRates['->' . $currency2];
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
Undefined array key "->EUR"

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:47
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:63
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/p

[Killed] PublicVisibility
Bank.php:62:5
      * @return Money
      * @throws MissingExchangeRateException
      */
-    public function convertMoney(Money $money, Currency $currency2): Money
+    protected function convertMoney(Money $money, Currency $currency2) : Money
     {
         if ($money->hasCurrency($currency2)) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Error: Call to protected method MoneyProblem\Domain\Bank::convertMoney() from scope MoneyProblem\Domain\Portfolio

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:21
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/Money

[Killed] IfNegation
Bank.php:64:9
      */
     public function convertMoney(Money $money, Currency $currency2): Money
     {
-        if ($money->hasCurrency($currency2)) {
-            return new Money($money->getAmount(), $currency2);
-        }
+        if (!$money->hasCurrency($currency2)) {
 
         if (!array_key_exists($money->getCurrency() . '->' . $this->pivotCurrency, $this->exchangeRates) ||
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
Failed asserting that 15.0 matches expected 17.

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:57

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] LogicalOr
Bank.php:68:9
             return new Money($money->getAmount(), $currency2);
         }
 
-        if (!array_key_exists($money->getCurrency() . '->' . $this->pivotCurrency, $this->exchangeRates) ||
-            !array_key_exists($this->pivotCurrency . '->' . $currency2, $this->exchangeRates)) {
+        if (!array_key_exists($money->getCurrency() . '->' . $this->pivotCurrency, $this->exchangeRates) && !array_key_exists($this->pivotCurrency . '->' . $currency2, $this->exchangeRates)) {
             throw new MissingExchangeRateException($money->getCurrency(), $currency2);
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_without_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_without_exchange_rate
TypeError: MoneyProblem\Domain\Money::convert(): Argument #1 ($rate) must be of type float, null given, called in /home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php on line 63

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/

[Killed] Concat
Bank.php:68:9
             return new Money($money->getAmount(), $currency2);
         }
 
-        if (!array_key_exists($money->getCurrency() . '->' . $this->pivotCurrency, $this->exchangeRates) ||
+        if (!array_key_exists('->' . $money->getCurrency() . $this->pivotCurrency, $this->exchangeRates) || !array_key_exists($this->pivotCurrency . '->' . $currency2, $this->exchangeRates)) {
             !array_key_exists($this->pivotCurrency . '->' . $currency2, $this->exchangeRates)) {
             throw new MissingExchangeRateException($money->getCurrency(), $currency2);
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:61
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:21
/home/runner/work/xtrem-c

[Killed] LogicalNot
Bank.php:69:13
         }
 
         if (!array_key_exists($money->getCurrency() . '->' . $this->pivotCurrency, $this->exchangeRates) ||
-            !array_key_exists($this->pivotCurrency . '->' . $currency2, $this->exchangeRates)) {
+            if (!array_key_exists($money->getCurrency() . '->' . $this->pivotCurrency, $this->exchangeRates) || array_key_exists($this->pivotCurrency . '->' . $currency2, $this->exchangeRates)) {
             throw new MissingExchangeRateException($money->getCurrency(), $currency2);
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:61
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:21
/home/runner/work/xtrem-c

[Killed] ConcatOperandRemoval
Bank.php:69:13
         }
 
         if (!array_key_exists($money->getCurrency() . '->' . $this->pivotCurrency, $this->exchangeRates) ||
-            !array_key_exists($this->pivotCurrency . '->' . $currency2, $this->exchangeRates)) {
+            if (!array_key_exists($money->getCurrency() . '->' . $this->pivotCurrency, $this->exchangeRates) || !array_key_exists($this->pivotCurrency . '->', $this->exchangeRates)) {
             throw new MissingExchangeRateException($money->getCurrency(), $currency2);
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:61
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:21
/home/runner/work/xtrem-c

[Killed] Throw_
Bank.php:70:13
 
         if (!array_key_exists($money->getCurrency() . '->' . $this->pivotCurrency, $this->exchangeRates) ||
             !array_key_exists($this->pivotCurrency . '->' . $currency2, $this->exchangeRates)) {
-            throw new MissingExchangeRateException($money->getCurrency(), $currency2);
+            new MissingExchangeRateException($money->getCurrency(), $currency2);
         }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_without_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_without_exchange_rate
TypeError: MoneyProblem\Domain\Money::convert(): Argument #1 ($rate) must be of type float, null given, called in /home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php on line 63

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/
