[Killed] Throw_
Money.php:16:13
     public function __construct(float $amount, Currency $currency)
     {
         if ($amount < 0) {
-            throw new \InvalidArgumentException('Cannot create negative money');
+            new \InvalidArgumentException('Cannot create negative money');
         }
         $this->amount = $amount;
killedBy: Tests\MoneyProblem\MoneyTest::testCreateNegativeMoney
statusReason: 1) Tests\MoneyProblem\MoneyTest::testCreateNegativeMoney
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Money.php:22:5
         $this->currency = $currency;
     }
 
-    public function getAmount()
+    protected function getAmount()
     {
         return $this->amount;
killedBy: Tests\MoneyProblem\MoneyTest::testCreatePositiveMoney
statusReason: 1) Tests\MoneyProblem\MoneyTest::testCreatePositiveMoney
Error: Call to protected method MoneyProblem\Domain\Money::getAmount() from scope Tests\MoneyProblem\MoneyTest

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:23

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[Killed] PublicVisibility
Money.php:32:5
         return $this->currency;
     }
 
-    public function hasCurrency(Currency $to): bool
+    protected function hasCurrency(Currency $to) : bool
     {
         return $this->currency == $to;
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Error: Call to protected method MoneyProblem\Domain\Money::hasCurrency() from scope MoneyProblem\Domain\Bank

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:64
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Doma

[Killed] Equal
Money.php:34:9
 
     public function hasCurrency(Currency $to): bool
     {
-        return $this->currency == $to;
+        return $this->currency != $to;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
Failed asserting that 15.0 matches expected 17.

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:57

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Money.php:37:5
         return $this->currency == $to;
     }
 
-    public function convert(float $rate, Currency $currency): Money
+    protected function convert(float $rate, Currency $currency) : Money
     {
         return new Money($this->amount * $rate, $currency);
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
Error: Call to protected method MoneyProblem\Domain\Money::convert() from scope MoneyProblem\Domain\Bank

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:74
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Dom

[Killed] Multiplication
Money.php:39:9
 
     public function convert(float $rate, Currency $currency): Money
     {
-        return new Money($this->amount * $rate, $currency);
+        return new Money($this->amount / $rate, $currency);
     }
     
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
Failed asserting that 13.333333333333334 matches expected 17.

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:57

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] NotEqual
Money.php:44:9
     
     public function add(Money $money): Money
     {
-        if ($this->currency != $money->currency) {
+        if ($this->currency == $money->currency) {
             throw new \InvalidArgumentException('Cannot add money with different currencies');
         }
killedBy: Tests\MoneyProblem\MoneyTest::testAddWithSameCurrencies
statusReason: 1) Tests\MoneyProblem\MoneyTest::testAddWithSameCurrencies
InvalidArgumentException: Cannot add money with different currencies

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:37
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:39

ERRORS!
Tests: 4, Assertions: 6, Errors: 1.

[Killed] Throw_
Money.php:45:13
     public function add(Money $money): Money
     {
         if ($this->currency != $money->currency) {
-            throw new \InvalidArgumentException('Cannot add money with different currencies');
+            new \InvalidArgumentException('Cannot add money with different currencies');
         }
         return new Money($this->amount + $money->amount, $this->currency);
killedBy: Tests\MoneyProblem\MoneyTest::testAddDifferentCurrency
statusReason: 1) Tests\MoneyProblem\MoneyTest::testAddDifferentCurrency
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 5, Assertions: 9, Failures: 1.

[Killed] Plus
Money.php:47:9
         if ($this->currency != $money->currency) {
             throw new \InvalidArgumentException('Cannot add money with different currencies');
         }
-        return new Money($this->amount + $money->amount, $this->currency);
+        return new Money($this->amount - $money->amount, $this->currency);
     }
 
killedBy: Tests\MoneyProblem\MoneyTest::testAddWithSameCurrencies
statusReason: 1) Tests\MoneyProblem\MoneyTest::testAddWithSameCurrencies
InvalidArgumentException: Cannot create negative money

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:13
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:39
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/

[Killed] PublicVisibility
Money.php:50:5
         return new Money($this->amount + $money->amount, $this->currency);
     }
 
-    public function divide(int $money): Money
+    protected function divide(int $money) : Money
     {
         if ($money == 0) {
killedBy: Tests\MoneyProblem\MoneyTest::testDivideCurrency
statusReason: 1) Tests\MoneyProblem\MoneyTest::testDivideCurrency
Error: Call to protected method MoneyProblem\Domain\Money::divide() from scope Tests\MoneyProblem\MoneyTest

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:59

ERRORS!
Tests: 6, Assertions: 10, Errors: 1.

[Killed] AssignmentEqual
Money.php:52:9
 
     public function divide(int $money): Money
     {
-        if ($money == 0) {
+        if ($money = 0) {
             throw new \LogicException('Cannot divide by zero');
         }
killedBy: Tests\MoneyProblem\MoneyTest::testDivideCurrency
statusReason: 1) Tests\MoneyProblem\MoneyTest::testDivideCurrency
DivisionByZeroError: Division by zero

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:46
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:59

ERRORS!
Tests: 6, Assertions: 10, Errors: 1.

[Killed] DecrementInteger
Money.php:52:9
 
     public function divide(int $money): Money
     {
-        if ($money == 0) {
+        if ($money == -1) {
             throw new \LogicException('Cannot divide by zero');
         }
killedBy: Tests\MoneyProblem\MoneyTest::testDivideZeroCurrency
statusReason: 1) Tests\MoneyProblem\MoneyTest::testDivideZeroCurrency
Failed asserting that exception of type "DivisionByZeroError" matches expected exception "LogicException". Message was: "Division by zero" at
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:46
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:71
.

[Killed] Throw_
Money.php:53:13
     public function divide(int $money): Money
     {
         if ($money == 0) {
-            throw new \LogicException('Cannot divide by zero');
+            new \LogicException('Cannot divide by zero');
         }
         return new Money($this->amount / $money, $this->currency);
killedBy: Tests\MoneyProblem\MoneyTest::testDivideZeroCurrency
statusReason: 1) Tests\MoneyProblem\MoneyTest::testDivideZeroCurrency
Failed asserting that exception of type "DivisionByZeroError" matches expected exception "LogicException". Message was: "Division by zero" at
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:46
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:71
.

[Killed] Division
Money.php:55:9
         if ($money == 0) {
             throw new \LogicException('Cannot divide by zero');
         }
-        return new Money($this->amount / $money, $this->currency);
+        return new Money($this->amount * $money, $this->currency);
     }
 
killedBy: Tests\MoneyProblem\MoneyTest::testDivideCurrency
statusReason: 1) Tests\MoneyProblem\MoneyTest::testDivideCurrency
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
-    'amount' => 16008.0
+    'amount' => 1000.5

[Killed] PublicVisibility
Money.php:58:5
         return new Money($this->amount / $money, $this->currency);
     }
 
-    public function multiply(int $money): Money
+    protected function multiply(int $money) : Money
     {
         return new Money($this->amount * $money, $this->currency);
killedBy: Tests\MoneyProblem\MoneyTest::testMultiplyCurrency
statusReason: 1) Tests\MoneyProblem\MoneyTest::testMultiplyCurrency
Error: Call to protected method MoneyProblem\Domain\Money::multiply() from scope Tests\MoneyProblem\MoneyTest

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:78

ERRORS!
Tests: 8, Assertions: 13, Errors: 1.

[Killed] Multiplication
Money.php:60:9
 
     public function multiply(int $money): Money
     {
-        return new Money($this->amount * $money, $this->currency);
+        return new Money($this->amount / $money, $this->currency);
     }
 
killedBy: Tests\MoneyProblem\MoneyTest::testMultiplyCurrency
statusReason: 1) Tests\MoneyProblem\MoneyTest::testMultiplyCurrency
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
-    'amount' => 2001.0
+    'amount' => 8004.0
