[Killed] PublicVisibility
Portfolio.php:9:5
 {
     private array $_money = [];
 
-    public function add(int $money, Currency $currency)
+    protected function add(int $money, Currency $currency)
     {
         if (!isset($this->_money[(string)$currency])) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Error: Call to protected method MoneyProblem\Domain\Portfolio::add() from scope Tests\MoneyProblem\PortfolioTest

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:27

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalNot
Portfolio.php:11:9
 
     public function add(int $money, Currency $currency)
     {
-        if (!isset($this->_money[(string)$currency])) {
+        if (isset($this->_money[(string) $currency])) {
             $this->_money[(string)$currency] = ['amount' => 0, 'currency' => $currency];
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Undefined array key "USD"

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:13
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:27

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] IncrementInteger
Portfolio.php:12:13
     public function add(int $money, Currency $currency)
     {
         if (!isset($this->_money[(string)$currency])) {
-            $this->_money[(string)$currency] = ['amount' => 0, 'currency' => $currency];
+            $this->_money[(string) $currency] = ['amount' => 1, 'currency' => $currency];
         }
         $this->_money[(string)$currency]["amount"] += $money;
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Failed asserting that 16.0 matches expected 15.

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:34

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Portfolio.php:12:13
     public function add(int $money, Currency $currency)
     {
         if (!isset($this->_money[(string)$currency])) {
-            $this->_money[(string)$currency] = ['amount' => 0, 'currency' => $currency];
+            $this->_money[(string) $currency] = ['amount' => -1, 'currency' => $currency];
         }
         $this->_money[(string)$currency]["amount"] += $money;
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Failed asserting that 14.0 matches expected 15.

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:34

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Assignment
Portfolio.php:14:9
         if (!isset($this->_money[(string)$currency])) {
             $this->_money[(string)$currency] = ['amount' => 0, 'currency' => $currency];
         }
-        $this->_money[(string)$currency]["amount"] += $money;
+        $this->_money[(string) $currency]["amount"] = $money;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Failed asserting that 5.0 matches expected 15.

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:34

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Portfolio.php:14:9
         if (!isset($this->_money[(string)$currency])) {
             $this->_money[(string)$currency] = ['amount' => 0, 'currency' => $currency];
         }
-        $this->_money[(string)$currency]["amount"] += $money;
+        $this->_money[(string) $currency]["amount"] -= $money;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
InvalidArgumentException: Cannot create negative money

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:16
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:19
/home/runner/work/xtrem-craft-wor

[Killed] PublicVisibility
Portfolio.php:17:5
         $this->_money[(string)$currency]["amount"] += $money;
     }
 
-    public function evaluate(Currency $currency, Bank $bank): int | float | null
+    protected function evaluate(Currency $currency, Bank $bank) : int|float|null
     {
         $total = 0;
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Error: Call to protected method MoneyProblem\Domain\Portfolio::evaluate() from scope Tests\MoneyProblem\PortfolioTest

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:31

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Foreach_
Portfolio.php:20:9
     public function evaluate(Currency $currency, Bank $bank): int | float | null
     {
         $total = 0;
-        foreach ($this->_money as $key => $value) {
-            $total += $bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount();
-            var_dump($bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount());
-        }
+        foreach (array() as $key => $value) {
 
         
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Failed asserting that 0 matches expected 15.

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:34

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Portfolio.php:21:13
     {
         $total = 0;
         foreach ($this->_money as $key => $value) {
-            $total += $bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount();
+            $total -= $bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount();
             var_dump($bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount());
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Failed asserting that -15.0 matches expected 15.

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:34

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Assignment
Portfolio.php:21:13
     {
         $total = 0;
         foreach ($this->_money as $key => $value) {
-            $total += $bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount();
+            $total = $bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount();
             var_dump($bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount());
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
Failed asserting that 12.0 matches expected 17.

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:57

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Survived] FunctionCallRemoval
Portfolio.php:22:13
         $total = 0;
         foreach ($this->_money as $key => $value) {
             $total += $bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount();
-            var_dump($bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount());
+            
         }
 
