[NoCoverage] PublicVisibility
Bank.php:34:5
         return $bank;
     }
 
-    public static function createBankPivot(Currency $currency)
+    protected static function createBankPivot(Currency $currency)
     {
         // TODO: Implement createBankPivot() method.

[NoCoverage] PublicVisibility
Bank.php:51:5
         $this->exchangeRates[($currency1 . '->' . $currency2)] = $rate;
     }
 
-    public function addPivotRate(Currency $currency, float $rate)
+    protected function addPivotRate(Currency $currency, float $rate)
     {
         // TODO: Implement addPivotRate() method.

[NoCoverage] PublicVisibility
Bank.php:56:5
         // TODO: Implement addPivotRate() method.
     }
 
-    public function getPivot()
+    protected function getPivot()
     {
         // TODO: Implement getPivot() method.

[NoCoverage] PublicVisibility
Bank.php:61:5
         // TODO: Implement getPivot() method.
     }
 
-    public function getPivotRate(Currency $currency)
+    protected function getPivotRate(Currency $currency)
     {
         // TODO: Implement getPivotRate() method.

[Killed] LogicalNot
Bank.php:68:9
 
     private function getExchangeRate(Currency $currency1, Currency $currency2): ?float
     {
-        if (!isset($this->exchangeRates[($currency1 . '->' . $currency2)])) {
+        if (isset($this->exchangeRates[$currency1 . '->' . $currency2])) {
             return null;
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
TypeError: MoneyProblem\Domain\Money::convert(): Argument #1 ($rate) must be of type float, null given, called in /home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php on line 77

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src

[Killed] ConcatOperandRemoval
Bank.php:71:9
         if (!isset($this->exchangeRates[($currency1 . '->' . $currency2)])) {
             return null;
         }
-        return $this->exchangeRates[($currency1 . '->' . $currency2)];
+        return $this->exchangeRates[$currency1 . $currency2];
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
Undefined array key "EURUSD"

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:61
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:77
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/

[Killed] ConcatOperandRemoval
Bank.php:85:9
         if ($money->hasCurrency($currency2)) {
             return new Money($money->getAmount(), $currency2);
         }
-        if (!array_key_exists($money->getCurrency() . '->' . $currency2, $this->exchangeRates)) {
+        if (!array_key_exists($money->getCurrency() . '->', $this->exchangeRates)) {
             throw new MissingExchangeRateException($money->getCurrency(), $currency2);
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:75
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:21
/home/runner/work/xtrem-c

[Killed] LogicalNot
Bank.php:85:9
         if ($money->hasCurrency($currency2)) {
             return new Money($money->getAmount(), $currency2);
         }
-        if (!array_key_exists($money->getCurrency() . '->' . $currency2, $this->exchangeRates)) {
+        if (array_key_exists($money->getCurrency() . '->' . $currency2, $this->exchangeRates)) {
             throw new MissingExchangeRateException($money->getCurrency(), $currency2);
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:75
/home/runner/work/xtrem-craft-workshop/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:21
/home/runner/work/xtrem-c
