[Killed] PublicVisibility
Bank.php:26:5
      * @param float $rate
      * @return Bank
      */
-    public static function create(Currency $currency1, Currency $currency2, float $rate)
+    protected static function create(Currency $currency1, Currency $currency2, float $rate)
     {
         $bank = new Bank([]);
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Error: Call to protected method MoneyProblem\Domain\Bank::create() from scope Tests\MoneyProblem\BankTest

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:16

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Bank.php:29:9
     public static function create(Currency $currency1, Currency $currency2, float $rate)
     {
         $bank = new Bank([]);
-        $bank->addEchangeRate($currency1, $currency2, $rate);
+        
 
         return $bank;
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:54
/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] PublicVisibility
Bank.php:41:5
      * @param float $rate
      * @return void
      */
-    public function addEchangeRate(Currency $currency1, Currency $currency2, float $rate): void
+    protected function addEchangeRate(Currency $currency1, Currency $currency2, float $rate) : void
     {
         $this->exchangeRates[($currency1 . '->' . $currency2)] = $rate;

[Killed] ConcatOperandRemoval
Bank.php:43:9
      */
     public function addEchangeRate(Currency $currency1, Currency $currency2, float $rate): void
     {
-        $this->exchangeRates[($currency1 . '->' . $currency2)] = $rate;
+        $this->exchangeRates[$currency1 . '->'] = $rate;
     }
 
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:54
/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ConcatOperandRemoval
Bank.php:43:9
      */
     public function addEchangeRate(Currency $currency1, Currency $currency2, float $rate): void
     {
-        $this->exchangeRates[($currency1 . '->' . $currency2)] = $rate;
+        $this->exchangeRates['->' . $currency2] = $rate;
     }
 
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:54
/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Bank.php:54:5
      * @return float
      * @throws MissingExchangeRateException
      */
-    public function convert(float $amount, Currency $currency1, Currency $currency2): float
+    protected function convert(float $amount, Currency $currency1, Currency $currency2) : float
     {
         if ($currency1 == $currency2) {
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Error: Call to protected method MoneyProblem\Domain\Bank::convert() from scope Tests\MoneyProblem\BankTest

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Equal
Bank.php:56:9
      */
     public function convert(float $amount, Currency $currency1, Currency $currency2): float
     {
-        if ($currency1 == $currency2) {
+        if ($currency1 != $currency2) {
             return $amount;
         }
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Failed asserting that 10.0 matches expected 12.

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:22

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] AssignmentEqual
Bank.php:56:9
      */
     public function convert(float $amount, Currency $currency1, Currency $currency2): float
     {
-        if ($currency1 == $currency2) {
+        if ($currency1 = $currency2) {
             return $amount;
         }
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Failed asserting that 10.0 matches expected 12.

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:22

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Concat
Bank.php:59:9
         if ($currency1 == $currency2) {
             return $amount;
         }
-        if (!array_key_exists($currency1 . '->' . $currency2, $this->exchangeRates)){
+        if (!array_key_exists($currency1 . $currency2 . '->', $this->exchangeRates)) {
             throw new MissingExchangeRateException($currency1, $currency2);
         }
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:54
/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Concat
Bank.php:59:9
         if ($currency1 == $currency2) {
             return $amount;
         }
-        if (!array_key_exists($currency1 . '->' . $currency2, $this->exchangeRates)){
+        if (!array_key_exists('->' . $currency1 . $currency2, $this->exchangeRates)) {
             throw new MissingExchangeRateException($currency1, $currency2);
         }
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:54
/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Bank.php:60:13
             return $amount;
         }
         if (!array_key_exists($currency1 . '->' . $currency2, $this->exchangeRates)){
-            throw new MissingExchangeRateException($currency1, $currency2);
+            new MissingExchangeRateException($currency1, $currency2);
         }
         return $amount * $this->exchangeRates[($currency1 . '->' . $currency2)];
killedBy: Tests\MoneyProblem\BankTest::test_convert_throws_exception_on_missing_exchange_rate
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_throws_exception_on_missing_exchange_rate
Undefined array key "EUR->KRW"

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:56
/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:43

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Concat
Bank.php:62:9
         if (!array_key_exists($currency1 . '->' . $currency2, $this->exchangeRates)){
             throw new MissingExchangeRateException($currency1, $currency2);
         }
-        return $amount * $this->exchangeRates[($currency1 . '->' . $currency2)];
+        return $amount * $this->exchangeRates[$currency1 . $currency2 . '->'];
     }
 
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Undefined array key "EURUSD->"

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:56
/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ConcatOperandRemoval
Bank.php:62:9
         if (!array_key_exists($currency1 . '->' . $currency2, $this->exchangeRates)){
             throw new MissingExchangeRateException($currency1, $currency2);
         }
-        return $amount * $this->exchangeRates[($currency1 . '->' . $currency2)];
+        return $amount * $this->exchangeRates[$currency1 . '->'];
     }
 
killedBy: Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_eur_to_usd_returns_float
Undefined array key "EUR->"

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:56
/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
