[Killed] MethodCallRemoval
MissingExchangeRateException.php:15:9
      */
     public function __construct(Currency $currency1, Currency $currency2)
     {
-        parent::__construct(sprintf('%s->%s', $currency1, $currency2));
+        
 
     }
killedBy: Tests\MoneyProblem\BankTest::test_convert_throws_exception_on_missing_exchange_rate
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_throws_exception_on_missing_exchange_rate
Failed asserting that exception message '' contains 'EUR->KRW'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
