[Killed] PublicVisibility
MoneyCalculator.php:14:5
      * @param float $amount2
      * @return float
      */
-    public static function add(float $amount, Currency $currency, float $amount2): float
+    protected static function add(float $amount, Currency $currency, float $amount2) : float
     {
         return $amount + $amount2;
killedBy: Tests\MoneyProblem\MoneyTest::test_add_in_usd_returns_value
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_add_in_usd_returns_value
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::add() from scope Tests\MoneyProblem\MoneyTest

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:14

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] Plus
MoneyCalculator.php:16:9
      */
     public static function add(float $amount, Currency $currency, float $amount2): float
     {
-        return $amount + $amount2;
+        return $amount - $amount2;
     }
 

[Killed] PublicVisibility
MoneyCalculator.php:26:5
      * @param int $value
      * @return float
      */
-    public static function multiply(float $amount, Currency $currency, int $value): float
+    protected static function multiply(float $amount, Currency $currency, int $value) : float
     {
         return $amount * $value;
killedBy: Tests\MoneyProblem\MoneyTest::test_multiply_in_euros_returns_positive_number
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_multiply_in_euros_returns_positive_number
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::multiply() from scope Tests\MoneyProblem\MoneyTest

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:25

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] Multiplication
MoneyCalculator.php:28:9
      */
     public static function multiply(float $amount, Currency $currency, int $value): float
     {
-        return $amount * $value;
+        return $amount / $value;
     }
 

[Killed] PublicVisibility
MoneyCalculator.php:38:5
      * @param int $value
      * @return float
      */
-    public static function divide(float $amount, Currency $currency, int $value): float
+    protected static function divide(float $amount, Currency $currency, int $value) : float
     {
         return $amount / $value;
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_in_korean_won_returns_float
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_in_korean_won_returns_float
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::divide() from scope Tests\MoneyProblem\MoneyTest

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:34

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Division
MoneyCalculator.php:40:9
      */
     public static function divide(float $amount, Currency $currency, int $value): float
     {
-        return $amount / $value;
+        return $amount * $value;
     }
 }
killedBy: Tests\MoneyProblem\MoneyTest::test_divide_in_korean_won_returns_float
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide_in_korean_won_returns_float
Failed asserting that 1000.5 matches expected 16008.0.

/home/anna/Cours/Securite_logiciel/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:37

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
