[Killed] ConcatOperandRemoval
Bank.php:48:9
 
     private function getExchangeRate(Currency $currency1, Currency $currency2): ?float
     {
-        if (!isset($this->exchangeRates[($currency1 . '->' . $currency2)])) {
+        if (!isset($this->exchangeRates[$currency1 . '->'])) {
             return null;
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
TypeError: MoneyProblem\Domain\Money::convert(): Argument #1 ($rate) must be of type float, null given, called in /home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php on line 61

/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/src/MoneyProb

[Killed] ConcatOperandRemoval
Bank.php:51:9
         if (!isset($this->exchangeRates[($currency1 . '->' . $currency2)])) {
             return null;
         }
-        return $this->exchangeRates[($currency1 . '->' . $currency2)];
+        return $this->exchangeRates[$currency1 . '->'];
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_different_currency_in_portfolio_with_exchange_rate
Undefined array key "EUR->"

/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:45
/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:61
/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/src/MoneyPro

[Killed] ConcatOperandRemoval
Bank.php:65:9
         if ($money->hasCurrency($currency2)) {
             return new Money($money->getAmount(), $currency2);
         }
-        if (!array_key_exists($money->getCurrency() . '->' . $currency2, $this->exchangeRates)) {
+        if (!array_key_exists('->' . $currency2, $this->exchangeRates)) {
             throw new MissingExchangeRateException($money->getCurrency(), $currency2);
         }
killedBy: Tests\MoneyProblem\BankTest::test_convert_money_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_money_eur_to_usd_returns_float
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:59
/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:25

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Concat
Bank.php:65:9
         if ($money->hasCurrency($currency2)) {
             return new Money($money->getAmount(), $currency2);
         }
-        if (!array_key_exists($money->getCurrency() . '->' . $currency2, $this->exchangeRates)) {
+        if (!array_key_exists('->' . $money->getCurrency() . $currency2, $this->exchangeRates)) {
             throw new MissingExchangeRateException($money->getCurrency(), $currency2);
         }
killedBy: Tests\MoneyProblem\BankTest::test_convert_money_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_money_eur_to_usd_returns_float
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:59
/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:25

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Bank.php:66:13
             return new Money($money->getAmount(), $currency2);
         }
         if (!array_key_exists($money->getCurrency() . '->' . $currency2, $this->exchangeRates)) {
-            throw new MissingExchangeRateException($money->getCurrency(), $currency2);
+            new MissingExchangeRateException($money->getCurrency(), $currency2);
         }
         return $money->convert($this->getExchangeRate($money->getCurrency(), $currency2), $currency2);
killedBy: Tests\MoneyProblem\BankTest::test_convert_money_throws_exception_on_missing_exchange_rate
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_money_throws_exception_on_missing_exchange_rate
/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:37
/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:61
/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:59
.

FAILURES!
