[Killed] Foreach_
Portfolio.php:20:9
     public function evaluate(Currency $currency, Bank $bank): int | float | null
     {
         $total = 0;
-        foreach ($this->_money as $key => $value) {
-            $total += $bank->convertMoney(new Money($value['amount'], $value['currency']), $currency)->getAmount();
-        }
+        foreach (array() as $key => $value) {
         return $total;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_total_money_with_same_currency_in_portfolio_with_exchange_rate
Failed asserting that 0 matches expected 15.

/home/alexandre/Bureau/git/gitlab/xtrem-craft-workshop/php/tests/MoneyProblem/PortfolioTest.php:31

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
